<?php

namespace Database\Factories;

use App\Models\User;
use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends Factory<User>
 */
class UserFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        return [
            'full_name' => fake()->name(),
            'mobile' => '09' . fake()->unique()->numerify('#########'),
            'email' => fake()->unique()->safeEmail(),
            'student_number' => fake()->randomElement([
                '401',
                '402',
                '403',
                '404',
                '405',
            ]) . fake()->unique()->numerify('######'),
            'field_of_study' => fake()->randomElement([
                // مهندسی کامپیوتر
                'مهندسی کامپیوتر',
                'مهندسی کامپیوتر - نرم افزار',
                'مهندسی کامپیوتر - هوش مصنوعی',
                'مهندسی کامپیوتر - شبکه های کامپیوتری',
                'مهندسی کامپیوتر - بیوانفورماتیک',

                // مهندسی برق
                'مهندسی برق',
                'مهندسی برق - سیستم های قدرت',

                // مهندسی عمران
                'مهندسی عمران',
                'مهندسی عمران - سازه',
                'مهندسی عمران - زلزله',
                'مهندسی عمران - مدیریت ساخت',
                'مهندسی عمران - آب و سازه های هیدرولیکی',

                // مهندسی صنایع
                'مهندسی صنایع',
                'مهندسی صنایع - سیستم های تولید و خدمات',

                // مهندسی معماری
                'مهندسی معماری',

                // مهندسی مکانیک
                'مهندسی مکانیک',

                // مهندسی پزشکی
                'مهندسی پزشکی',
                'مهندسی پزشکی - بیوالکتریک',
                'مهندسی پزشکی - توانبخشی',

                // زیست فناوری
                'زیست فناوری',

                // شهرسازی
                'مهندسی شهرسازی',

                // معماری داخلی
                'معماری داخلی',

                // ارتباط تصویری
                'ارتباط تصویری',

                // مدیریت
                'مدیریت بازرگانی',
                'مدیریت بازرگانی - بازاریابی',
                'مدیریت صنعتی',
                'مدیریت صنعتی - تولید و عملیات',
                'مدیریت مالی',
                'مدیریت بانکی',
                'مدیریت کسب و کار',

                // حسابداری
                'حسابداری',
                'حسابرسی',

                // روانشناسی
                'روانشناسی',
                'روانشناسی بالینی',
                'روانشناسی ورزشی',

                // مشاوره
                'مشاوره',

                // علوم ورزشی
                'علوم ورزشی',

                // زبان
                'زبان انگلیسی',

                // حقوق
                'حقوق',
            ]),
            'university_name' => 'دانشگاه شهاب دانش',
            'bio' => fake()->text(),
            'avatar' => null,
            'resume_file' => null,
            'is_active' => true,
        ];
    }
}
